# Вывести на экран числа от -N до N

N = int(input('Введи число: '))
r = range(-N, N)
for i in r:
    print(i)